Repository: ministryofjustice/money-to-prisoners-noms-ops
Catalog: mtp_noms_ops/translations/*/LC_MESSAGES/django.po
Languages: cy

source: Location file
cy: Ffeil lleoliad

source: Please choose a file
cy: Dewiswch ffeil

source: Uploaded file must be a CSV
cy: Rhaid i'r ffeil a ddewisir fod yn CSV

source: Can’t read CSV file
cy: Ni ellir darllen y ffeil CSV

source: The file has the wrong number of columns
cy: Mae gan y ffeil y nifer anghywir o golofnau

source: Date of birth "%s" is not in a valid format
cy: Nid yw'r dyddiad geni "%s" mewn fformat dilys

source: The file doesn’t contain valid rows
cy: Nid yw'r ffeil yn cynnwys rhesi dilys

source: An unknown error occurred uploading prisoner locations
cy: Mi ddigwyddodd gwall anhysbys wrth lwytho lleoliadau'r carcharor

source: Prisoner money: prisoner location update failed
cy: Arian carcharor: diweddaru lleoliad carcharor wedi methu

source: %d prisoner location scheduled for upload.
cy: %d lleoliad carcharor wedi'i drefnu i'w lwytho.

source: You will receive an email notification if the upload fails.
cy: Byddwch yn cael e-bost os na fydd yr wybodaeth yn llwytho'n iawn.

source: %d prisoner location updated successfully
cy: %d lleoliad carcharor wedi'i ddiweddaru'n llwyddiannus

source: Bank transfer
cy: Trosglwyddiad banc

source: Debit card
cy: Cerdyn debyd

source: Prisoner name
cy: Enw'r carcharor

source: Prisoner number
cy: Rhif y carcharor

source: Prison
cy: Carchar

source: Sender name
cy: Enw'r anfonwr

source: Payment method
cy: Dull talu

source: Bank transfer sort code
cy: Cod didoli'r trosglwyddiad banc

source: Bank transfer account
cy: Cyfrif y trosglwyddiad banc

source: Bank transfer roll number
cy: Rhif rhestr y trosglwyddiad banc

source: Debit card number
cy: Rhif y cerdyn debyd

source: Debit card expiry
cy: Dyddiad dod i ben y cerdyn debyd

source: Address
cy: Cyfeiriad

source: Amount
cy: Swm

source: Date received
cy: Dyddiad derbyn

source: Credited status
cy: Statws credydu

source: Date credited
cy: Dyddiad cafodd ei gredydu

source: NOMIS ID
cy: Rhif adnabod NOMIS

source: Any method
cy: Unrhyw ddull

source: Select an option
cy: Dewiswch opsiwn

source: Invalid amount
cy: Swm annilys

source: Invalid prisoner number
cy: Rhif carcharor annilys

source: Must be greater than the lower bound
cy: Rhaid iddo fod yn uwch na'r terfyn isaf

source: This service is currently unavailable
cy: Nid yw'r gwasanaeth hwn ar gael ar hyn o bryd

source: Must be larger than the minimum prisoners
cy: Rhaid iddo fod yn fwy na'r isafswm o garcharorion

source: Must be larger than the minimum credits
cy: Rhaid iddo fod yn fwy na'r isafswm o gredydau

source: Must be larger than the minimum total
cy: Rhaid iddo fod yn fwy na'r cyfanswm lleiaf

source: Order by
cy: Drwy orchymyn

source: Number of prisoners (low to high)
cy: Nifer o garcharorion (isaf i'r uchaf)

source: Number of prisoners (high to low)
cy: Nifer o garcharorion (uchaf i'r isaf)

source: Number of prisons (low to high)
cy: Nifer o garchardai (isaf i'r uchaf)

source: Number of prisons (high to low)
cy: Nifer o garchardai (uchaf i'r isaf)

source: Number of credits (low to high)
cy: Nifer o gredydau (isaf i'r uchaf)

source: Number of credits (high to low)
cy: Nifer o gredydau (uchaf i'r isaf)

source: Total sent (low to high)
cy: Cyfanswm a anfonwyd (isaf i'r uchaf)

source: Total sent (high to low)
cy: Cyfanswm a anfonwyd (uchaf i'r isaf)

source: Number of prisoners (minimum)
cy: Nifer o garcharorion (lleiafswm)

source: Maximum prisoners sent to
cy: Anfonwyd at yr uchafswm o garcharorion

source: Number of prisons (minimum)
cy: Nifer o garchardai (lleiafswm)

source: Maximum prisons sent to
cy: Anfonwyd at yr uchafswm o garchardai

source: Minimum credits sent
cy: Isafswm o gredydau wedi'u hanfon

source: Maximum credits sent
cy: Uchafswm o gredydau wedi'u hanfon

source: Minimum total sent
cy: Isafswm wedi'i anfon

source: Maximum total sent
cy: Uchafswm wedi'i anfon

source: Sender sort code
cy: Cod didoli'r anfonwr

source: for example 01-23-45
cy: er enghraifft 01-23-45

source: Sender account number
cy: Rhif cyfrif yr anfonwr

source: Sender roll number
cy: Rhif rhestr yr anfonwr

source: Last 4 digits of card number
cy: 4 digid olaf rhif y cerdyn

source: Sender email
cy: E-bost yr anfonwr

source: Prison region
cy: Rhanbarth y carchar

source: Prison type
cy: Math o garchar

source: Prison category
cy: Categori'r carchar

source: All prisons
cy: Pob carchar

source: All regions
cy: Pob rhanbarth

source: All types
cy: Pob Math

source: All categories
cy: Pob categori

source: Must be larger than the minimum senders
cy: Rhaid iddo fod yn fwy na'r isafswm o anfonwyr

source: Number of senders (low to high)
cy: Nifer o anfonwyr (isaf i'r uchaf)

source: Number of senders (high to low)
cy: Nifer o anfonwyr (uchaf i'r isaf)

source: Total received (low to high)
cy: Nifer a gafwyd (isaf i'r uchaf)

source: Total received (high to low)
cy: Nifer a gafwyd (uchaf i'r isaf)

source: Prisoner name (A to Z)
cy: Enw'r carchar (A i Z)

source: Prisoner name (Z to A)
cy: Enw'r carchar (Z i A)

source: Prisoner number (A to Z)
cy: Rhif y carcharor (A i Z)

source: Prisoner number (Z to A)
cy: Rhif y carcharor (Z i A)

source: Number of senders (minimum)
cy: Nifer o anfonwyr (lleiafswm)

source: Maximum senders received from
cy: Arian wedi'i dderbyn gan y nifer fwyaf o anfonwyr

source: Minimum credits received
cy: Isafswm o gredydau wedi'u derbyn

source: Maximum credits received
cy: Uchafswm o gredydau wedi'u derbyn

source: Minimum total received
cy: Isafswm wedi'u derbyn

source: Maximum total received
cy: Uchafswm wedi'u derbyn

source: Not a whole number
cy: Nid yw'n gyfanrif

source: Not a multiple of £5
cy: Nid yw'n lluosrif o £5

source: Not a multiple of £10
cy: Nid yw'n lluosrif o £10

source: £100 or more
cy: £100 neu fwy

source: Exact amount
cy: Union swm

source: Exact number of pence
cy: Union nifer o geiniogau

source: Must be after the start date
cy: Rhaid iddo fod ar ôl y dyddiad cychwyn

source: Received date (oldest to newest)
cy: Dyddiad derbyn (cynharaf i'r diweddaraf)

source: Received date (newest to oldest)
cy: Dyddiad derbyn (diweddaraf i'r cynharaf)

source: Amount sent (low to high)
cy: Swm a anfonwyd (isaf i'r uchaf)

source: Amount sent (high to low)
cy: Swm a anfonwyd (uchaf i'r isaf)

source: Received from
cy: Derbyniwyd gan

source: for example 01/06/2016
cy: er enghraifft 01/06/2016

source: Received to
cy: Derbyniwyd i

source: Amount (£)
cy: Swm (£)

source: Any amount
cy: Unrhyw swm

source: This field is required for the selected amount pattern
cy: Rhaid llenwi'r maes hwn oherwydd y swm sydd wedi'i ddethol

source: ending in %02d pence
cy: gorffen gyda %02d ceiniog

source: Not found
cy: Ni ellir dod o hyd iddo

source: Prisoner money intelligence
cy: Gwybodaeth am arian carcharor

source: Initial
cy: Arwyddo

source: Pending
cy: Aros

source: Requires manual processing
cy: Rhaid ei brosesu â llaw

source: Credited
cy: Wedi cael ei gredydu

source: Refunded
cy: Wedi'i ad-dalu

source: Home
cy: Cartref

source: Credits
cy: Credydau

source: Payment sources
cy: Dulliau talu

source: Unknown sender
cy: Anfonwr anhysbys

source: Prisoners
cy: Carcharorion

source: Unknown prisoner
cy: Carcharor anhysbys

source: New credits check
cy: Gwirio credydau newydd

source: %(count)d credits have been marked as checked by security
cy: Mae %(count)d o gredydau wedi cael eu marcio fel eu bod wedi cael eu gwirio gan y staff diogelwch

source: Built by
cy: Cynhyrchwyd gan

source: Ministry of Justice
cy: Y Weinyddiaeth Cyfiawnder

source: Welcome %(full_name)s
cy: Croeso %(full_name)s

source: Use this tool to monitor all credits sent to prisoners using the <a href="%(start_page_url)s">Send money to someone in prison</a> service.
cy: Defnyddiwch yr adnodd hwn i fonitro'r holl gredydau a anfonwyd at garcharorion gan ddefnyddio'r <a href="%(start_page_url)s">gwasanaeth</a> Anfon arian at rywun sydd yn y carchar.

source: View all
cy: Gweld bob un

source: Payment sources and prisoners you are monitoring
cy: Dulliau talu a charcharorion yr ydych yn eu monitro

source: 1 new credit
cy: 1 credyd newydd

source: Admin options
cy: Opsiynau gweinyddol

source: Manage users
cy: Rheoli defnyddwyr

source: Upload prisoner location file
cy: Llwytho ffeil lleoliad carcharor

source: The upload of the prisoner location file failed, with the following errors:
cy: Methodd ffeil lleoliad y carcharor â llwytho'n iawn gan ei bod yn cynnwys y gwallau canlynol:

source: You may need to try uploading the prisoner location report again.
cy: Efallai y bydd angen i chi geisio llwytho adroddiad lleoliad y carcharor eto.

source: If you are unsure what the problem might be, please contact us at %(feedback_url)s
cy: Os nad ydych yn siwr beth yw'r broblem, cysylltwch â ni yn %(feedback_url)s

source: Prisoner money
cy: Arian carcharor

source: Run the “Electronic Credits and Prisoner Establishment Locations” report in P-NOMIS, then upload the file on this page in CSV format (.csv)
cy: Creu adroddiad “Credydau Electronig a Lleoliadau Carcharorion” yn P-NOMIS, ac yna llwytho'r ffeil ar y dudalen hon mewn fformat CSV (.csv)

source: Please note that the uploaded prisoner locations will replace all those currently stored in the system.
cy: Sylwch os gwelwch yn dda y bydd y lleoliadau carcharor sy'n cael eu llwytho yn disodli'r rhai hynny sydd eisoes wedi cael eu storio yn y system

source: Choose file
cy: Dewis ffeil

source: Upload file
cy: Llwytho ffeil

source: Upload another file
cy: Llwytho ffeil arall

source: Print
cy: Argraffu

source: Payment source and type
cy: Dull a math talu

source: Prisoner
cy: Carcharor

source: by debit card
cy: gyda cherdyn debyd

source: by bank transfer
cy: trosglwyddiad banc

source: by %(name_of_clerk)s
cy: gan %(name_of_clerk)s

source: No
cy: Na

source: No matching credits found
cy: Ni ddaethpwyd o hyd i unrhyw gredydau sy'n cyfateb

source: Filter by
cy: Hidlo yn ôl

source: Date
cy: Dyddiad

source: Sender
cy: Anfonwr

source: Min
cy: Isafswm

source: Max
cy: Uchafswm

source: From
cy: Gan

source: To
cy: I

source: Sort
cy: Didoli

source: Payment source
cy: Dull talu

source: Total sent (£)
cy: Cyfanswm a anfonwyd (£)

source: Total credits sent
cy: Cyfanswm y credydau a anfonwyd

source: Filter list
cy: Rhestr hidlo

source: Clear filters
cy: Clirio hidlwyr

source: Export
cy: Allforio

source: Close
cy: Cau

source: In ascending order
cy: Trefn esgynnol

source: In descending order
cy: Trefn ddisgynnol

source: Stop monitoring this profile
cy: Stopio monitro'r proffil hwn

source: Monitor this profile on your home page
cy: Monitro'r proffil hwn ar eich tudalan gartref

source: Photo of the prisoner
cy: Llun o'r carcharor

source: Held at %(prison)s
cy: Cadwyd mewn %(prison)s

source: Credits received
cy: Credydau a gafwyd

source: Total amount received
cy: Cyfanswm y swm a gafwyd

source: Names given by senders
cy: Enwau a roddwyd gan anfonwyr

source: Monitor this prisoner on your home page
cy: Monitro'r carcharor hwn ar eich tudalen gartref

source: Stop monitoring this prisoner
cy: Stopio monitro'r carcharor hwn

source: Name entered by sender
cy: Enw a nodwyd gan yr anfonwr

source: Received at prison
cy: Wedi cyrraedd y carchar

source: Card number
cy: Rhif y cerdyn

source: Account number
cy: Rhif y cyfrif

source: Sort code
cy: Cod didoli

source: Roll number (for building societies)
cy: Rhif rhestr (ar gyfer cymdeithasau adeiladu)

source: Crediting staff
cy: Staff credydu

source: Received
cy: Wedi cyrraedd

source: <strong>%(count)s</strong> credit received
cy: <strong>%(count)s</strong> credyd wedi'u cael

source: <strong>%(count)s</strong> payment source
cy: <strong>%(count)s</strong> dull talu

source: No matching prisoners found
cy: Ni daethpwyd o hyd i unrhyw garcharorion sy'n cyfateb

source: Credits must be checked by security before cashiers can process them.
cy: Rhaid i'r credydau gael eu gwirio gan y staff diogelwch cyn gall yr arianwyr eu prosesu.

source: Please check the following credits, add any comments then select ‘Credits checked by security’.
cy: Gwiriwch y credydau canlynol, ychwanegwch unrhyw sylwadau ac yna dewiswch ‘Credydau wedi cael eu gwirio gan y staff diogelwch’.

source: Comments will be visible to business hub staff in the digital cashbook.
cy: Bydd staff y ganolfan fusnes yn gallu gweld y sylwadau sydd yn y llyfr arian digidol

source: Credits checked by security
cy: Credydau wedi cael eu gwirio gan y staff diogelwch

source: Print these credits
cy: Argraffu'r credydau hyn

source: Please check the following credits
cy: Gwiriwch y credydau canlynol

source: Security comments
cy: Sylwadau'r staff diogelwch

source: Debit card payment
cy: Taliad cerdyn debyd

source: Add security comment for credit of %(amount)s to %(prisoner_name)s
cy: Ychwanegu sylwadau am ddiogelwch er mwyn credydu %(amount)s i %(prisoner_name)s

source: Have you checked these credits?
cy: Ydych chi wedi gwirio'r credydau hyn?

source: These credits will be marked as checked in the digital cashbook.
cy: Bydd y credydau hyn yn cael eu marcio fel wedi cael eu gwirio yn y llyfr arian digidol.

source: You can view credits again in ‘Search all prison credits’.
cy: Gallwch weld y credydau eto yn ‘Chwilio am holl gredydau carchar’.

source: Yes, all credits checked
cy: Ydi, mae'r holl gredydau wedi cael eu gwirio

source: No, continue checking
cy: Na, pharhewch i wirio

source: No new credits for review.
cy: Dim credydau newydd i'w hadolygu.

source: Bank transfer payments with these details
cy: Taliadau trosglwyddiad banc gyda'r manylion hyn

source: Debit card payments with these details
cy: Taliadau cerdyn debyd gyda'r manylion hyn

source: How are these grouped?
cy: Sut caiff y rhain eu grwpio?

source: Expiry date
cy: Dyddiad daw i ben

source: Postcode
cy: Cod post

source: Credits sent
cy: Credydau a anfonwyd

source: Prisons
cy: Carchardai

source: Total amount sent
cy: Cyfanswm y swm a anfonwyd

source: Monitor this sender on your home page
cy: Monitro'r anfonwr hwn ar eich tudalen gartref

source: Stop monitoring this sender
cy: Stopio monitro'r anfonwr hwn

source: Email
cy: E-bost

source: How these credits are grouped
cy: Sut mae'r credydau hyn yn cael eu grwpio

source: We group the payment sources by the debit card’s last 4 digits, expiry date and postcode.
cy: Rydym yn grwpio'r dulliau talu yn ôl 4 digid olaf y cerdyn debyd, y dyddiad dod i ben a'r cod post.

source: We do this because card industry compliance doesn’t allow using the full card number as a unique ID.
cy: Rydym yn gwneud hyn oherwydd nad yw trefniadau’r diwydiant cardiau yn caniatáu defnyddio’r rhif cerdyn llawn fel rhif adnabod unigryw.

source: In almost all cases, this results in one specific card and cardholder.
cy: Mewn bron pob achos, mae hyn yn arwain at un cerdyn a deiliad cerdyn penodol.

source: But, for the avoidance of doubt, we’ve listed details for each transaction below.
cy: Ond, er mwyn osgoi amheuaeth, rydym wedi rhestru manylion pob trafodyn isod.

source: OK
cy: Iawn

source: Sent
cy: Anfon

source: <strong>%(count)s</strong> credit sent
cy: <strong>%(count)s</strong> credyd wedi'u hanfon

source: <strong>%(count)s</strong> prisoner
cy: <strong>%(count)s</strong> carcharor

source: <strong>%(count)s</strong> prison
cy: <strong>%(count)s</strong> carchar

source: No matching payment sources found
cy: Ni ddaethpwyd o hyd i unrhyw ddulliau talu sy'n cyfateb.

source: Prisoner location admin
cy: Lleoliad carcharor - gweinyddol

source: Go to the homepage
cy: Ewch i dudalen gartref
